---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricRoundingManager.TotalLengthRoundingMethod
source: html/16f423e8-39d9-e178-18a6-a4488087a7d7.htm
---
# Autodesk.Revit.DB.Structure.FabricRoundingManager.TotalLengthRoundingMethod Property

Identifies the total length rounding method

## Syntax (C#)
```csharp
public RoundingMethod TotalLengthRoundingMethod { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: IsActiveOnElement property is false.